app/controllers/bookings_controller.rb

  def index
    bookings = Booking.all
---
SELECT "bookings".* FROM "bookings" WHERE (end_date >= '2020-01-17' AND start_date <= '2020-01-16')

  def create
    # Check for dates/times overlapping
    puts current_user[:id], "CURRENT USER"
    overlap = Booking.where('end_date > ? AND start_date < ?', booking_params[:start_date], booking_params[:end_date])

    # If room is free, create booking
    if overlap.length.zero?
      booking = Booking.create!(booking_params)
---
SELECT "bookings".* FROM "bookings" WHERE (end_date >= '2020-02-05' AND start_date <= '2020-02-01' AND end_time >= '10:30' AND start_time <= '10:30')
SELECT "bookings".* FROM "bookings" WHERE (start_date <= '2020-02-10T15:00Z' AND end_date >= '2020-02-06T20:01Z')
INSERT INTO "bookings" ("start_time", "end_time", "start_date", "end_date", "room_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    booking = Booking.find(params[:id])

    # Check if user is the owner of the booking
    if current_user[:id] == booking[:user_id]
      if booking.update_attributes(booking_params)
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bookings" SET "user_id" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["user_id", 2], ["updated_at", "2020-10-09 11:08:20.734316"], ["id", 1]]

  def destroy
    booking = Booking.find(params[:id])

    # Check if user is the owner of the booking
    if current_user[:id] == booking[:user_id]
      if booking.destroy
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 2]]