app/controllers/participants_controller.rb

  def create
    participant = Participant.create!(participant_params)
---
INSERT INTO "participants" ("booking_id", "invitee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["booking_id", 1], ["invitee_id", 1], ["created_at", "2020-10-14 17:59:47.351393"], ["updated_at", "2020-10-14 17:59:47.351393"]]