app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    bookings = Room.all